Revit 2027 API
BoundaryConditions.CreatePointBoundaryConditions(Document, ElementId, XYZ, TranslationRotationValue, Double, TranslationRotationValue, Double, TranslationRotationValue, Double, TranslationRotationValue, Double, TranslationRotationValue, Double, TranslationRotationValue, Double) Method
 Creates a new custom point boundary conditions within the project.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static BoundaryConditions CreatePointBoundaryConditions(
	Document doc,
	ElementId hostElemId,
	XYZ point,
	TranslationRotationValue X_Translation,
	double X_TranslationSpringModulus,
	TranslationRotationValue Y_Translation,
	double Y_TranslationSpringModulus,
	TranslationRotationValue Z_Translation,
	double Z_TranslationSpringModulus,
	TranslationRotationValue X_Rotation,
	double X_RotationSpringModulus,
	TranslationRotationValue Y_Rotation,
	double Y_RotationSpringModulus,
	TranslationRotationValue Z_Rotation,
	double Z_RotationSpringModulus
)
Public Shared Function CreatePointBoundaryConditions (
	doc As Document,
	hostElemId As ElementId,
	point As XYZ,
	X_Translation As TranslationRotationValue,
	X_TranslationSpringModulus As Double,
	Y_Translation As TranslationRotationValue,
	Y_TranslationSpringModulus As Double,
	Z_Translation As TranslationRotationValue,
	Z_TranslationSpringModulus As Double,
	X_Rotation As TranslationRotationValue,
	X_RotationSpringModulus As Double,
	Y_Rotation As TranslationRotationValue,
	Y_RotationSpringModulus As Double,
	Z_Rotation As TranslationRotationValue,
	Z_RotationSpringModulus As Double
) As BoundaryConditions
public:
static BoundaryConditions^ CreatePointBoundaryConditions(
	Document^ doc,
	ElementId^ hostElemId,
	XYZ^ point,
	TranslationRotationValue X_Translation,
	double X_TranslationSpringModulus,
	TranslationRotationValue Y_Translation,
	double Y_TranslationSpringModulus,
	TranslationRotationValue Z_Translation,
	double Z_TranslationSpringModulus,
	TranslationRotationValue X_Rotation,
	double X_RotationSpringModulus,
	TranslationRotationValue Y_Rotation,
	double Y_RotationSpringModulus,
	TranslationRotationValue Z_Rotation,
	double Z_RotationSpringModulus
)
static member CreatePointBoundaryConditions :
        doc : Document *
        hostElemId : ElementId *
        point : XYZ *
        X_Translation : TranslationRotationValue *
        X_TranslationSpringModulus : float *
        Y_Translation : TranslationRotationValue *
        Y_TranslationSpringModulus : float *
        Z_Translation : TranslationRotationValue *
        Z_TranslationSpringModulus : float *
        X_Rotation : TranslationRotationValue *
        X_RotationSpringModulus : float *
        Y_Rotation : TranslationRotationValue *
        Y_RotationSpringModulus : float *
        Z_Rotation : TranslationRotationValue *
        Z_RotationSpringModulus : float -> BoundaryConditions
Parameters
doc Document
 The document in which to create the boundary conditions.
hostElemId ElementId
 The AnalyticalElement host element for the point boundary conditions.
point XYZ
 The position of point boundary conditions, measured in decimal feet.
X_Translation TranslationRotationValue
 A value indicating the X axis translation option.
X_TranslationSpringModulus Double
 Translation Spring Modulus for X axis. Ignored if X_Translation is not "Spring".
Y_Translation TranslationRotationValue
 A value indicating the Y axis translation option.
Y_TranslationSpringModulus Double
 Translation Spring Modulus for Y axis. Ignored if Y_Translation is not "Spring".
Z_Translation TranslationRotationValue
 A value indicating the Z axis translation option.
Z_TranslationSpringModulus Double
 Translation Spring Modulus for Z axis. Ignored if Z_Translation is not "Spring".
X_Rotation TranslationRotationValue
 A value indicating the X axis rotation option.
X_RotationSpringModulus Double
 Rotation Spring Modulus for X axis. Ignored if X_Rotation is not "Spring".
Y_Rotation TranslationRotationValue
 A value indicating the Y axis rotation option.
Y_RotationSpringModulus Double
 Rotation Spring Modulus for Y axis. Ignored if Y_Rotation is not "Spring".
Z_Rotation TranslationRotationValue
 A value indicating the Z axis rotation option.
Z_RotationSpringModulus Double
 Rotation Spring Modulus for Z axis. Ignored if Z_Rotation is not "Spring".
Return Value
BoundaryConditions
 If successful, returns the newly created boundary conditions with the BoundaryConditionsType = 0 - "Point". Otherwise it returns null .
Exceptions
Exception | Condition
ArgumentException |  hostElemId is not a valid host for point boundary conditions. -or- Point boundary conditions already exist on the selected hostElemId.
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
BoundaryConditions Class
CreatePointBoundaryConditions Overload
Autodesk.Revit.DB.Structure Namespace